Autodesk.Revit.DB.PaperSize.Name
Retrieve the paper size name of current project.

Autodesk.Revit.DB.PaperSize
An object that represents a Paper Size of Print Setup within the Autodesk Revit project.
Remarks: This object derived from the APIObject base object.